clear;
clc;

%A1 导致故障的样本集，A2 导致正常的样本集，两者参数项都取正常的参数,不存在则为0
data_gz = xlsread('C1.xlsx');
[a, b] = size(data_gz);
data_zc = xlsread('C2.xlsx');
[c, d] = size(data_zc);

%各特征的权重w等于其变异系数占总变异系数的概率
w = [0.090918222,0.081980853,0.096283568,0.089253191,0.098231678,...
     0.006297036,0.002541642,0.001723954,0.004255227,0.015988422,...
     0.098910481,0.063557656,0.008649716,0.082026046,0.082026046,...
     0.061227922,0.061253648,0.003141365,0.008115261,0.003136224,...
     0.040481894];
sum = 1;

%idx表示五个主要参数
idx = [3, 5 , 6, 7 , 8]; %主要参数 2, 4, 5, 6, 7

%求解故障判定距离
for j = 2 : b
    %求解欧氏距离
    if j > idx(length(idx))
        break;
    end
    if j == 3 || j == 5 || j == 6 || j == 7 || j == 8
    x1 = mean(data_gz(:,j));
    x2 = mean(data_zc(:, j));
    dis = sqrt(abs(x2 * x2 - x1 * x1));
    sum = sum * (dis ^ w(j-1));
    %end
end

sum

